# PointAdaptiveConstrained Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointAdaptiveConstrained Property
ParameterTypeId Class See Also
---
"Constrained"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointAdaptiveConstrained { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointAdaptiveConstrained As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointAdaptiveConstrained {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace